Белгипрозем_2017/src/ChartsOfCharacteristicTypes/ВидыДоступа/ВидыДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыДоступа</name>
  <type>
    <types>CatalogRef.ПапкиФайлов</types>
    <types>CatalogRef.ВнешниеПользователи</types>
    <types>CatalogRef.ГруппыДоступаФизическихЛиц</types>
    <types>CatalogRef.ВидыМероприятий</types>
    <types>CatalogRef.ВидыВнутреннихДокументов</types>
    <types>CatalogRef.ГруппыВнешнихПользователей</types>
    <types>CatalogRef.ГруппыПользователей</types>
    <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.ПапкиФорума</types>
    <types>CatalogRef.ГрифыДоступа</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.ВидыВходящихДокументов</types>
    <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    <types>CatalogRef.ВопросыДеятельности</types>
    <types>CatalogRef.ВидыИсходящихДокументов</types>
    <types>CatalogRef.ПапкиМероприятий</types>
    <types>CatalogRef.ПапкиВнутреннихДокументов</types>
    <types>CatalogRef.ГруппыДоступаКорреспондентов</types>
  </type>
  <predefined>
    <items>
      <name>ВидыВнутреннихДокументов</name>
      <description>Виды внутренних документов</description>
      <type>
        <types>CatalogRef.ВидыВнутреннихДокументов</types>
      </type>
    </items>
    <items>
      <name>ВидыВходящихДокументов</name>
      <description>Виды входящих документов</description>
      <type>
        <types>CatalogRef.ВидыВходящихДокументов</types>
      </type>
    </items>
    <items>
      <name>ВидыИсходящихДокументов</name>
      <description>Виды исходящих документов</description>
      <type>
        <types>CatalogRef.ВидыИсходящихДокументов</types>
      </type>
    </items>
    <items>
      <name>ВидыМероприятий</name>
      <description>Виды мероприятий</description>
      <type>
        <types>CatalogRef.ВидыМероприятий</types>
      </type>
    </items>
    <items>
      <name>ВнешниеПользователи</name>
      <description>Внешние пользователи</description>
      <type>
        <types>CatalogRef.ВнешниеПользователи</types>
        <types>CatalogRef.ГруппыВнешнихПользователей</types>
      </type>
    </items>
    <items>
      <name>ВопросыДеятельности</name>
      <description>Вопросы деятельности</description>
      <type>
        <types>CatalogRef.ВопросыДеятельности</types>
      </type>
    </items>
    <items>
      <name>ГрифыДоступа</name>
      <description>Грифы доступа</description>
      <type>
        <types>CatalogRef.ГрифыДоступа</types>
      </type>
    </items>
    <items>
      <name>ГруппыДоступаКорреспондентов</name>
      <description>Группы доступа корреспондентов</description>
      <type>
        <types>CatalogRef.ГруппыДоступаКорреспондентов</types>
      </type>
    </items>
    <items>
      <name>ГруппыДоступаФизическихЛиц</name>
      <description>Группы доступа физических лиц</description>
      <type>
        <types>CatalogRef.ГруппыДоступаФизическихЛиц</types>
      </type>
    </items>
    <items>
      <name>ДополнительныеСведения</name>
      <description>Дополнительные сведения</description>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </items>
    <items>
      <name>Организации</name>
      <description>Организации</description>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </items>
    <items>
      <name>Пользователи</name>
      <description>Пользователи</description>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

Белгипрозем_2017/src/ChartsOfCharacteristicTypes/ВидыДоступа/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СкрытыеВидыДоступа = Новый СписокЗначений;
	
	Если НЕ ВнешниеПользователи.ИспользоватьВнешнихПользователей() Тогда
		СкрытыеВидыДоступа.Добавить(ПланыВидовХарактеристик.ВидыДоступа.ВнешниеПользователи);
	КонецЕсли;
	
	СкрытыеВидыДоступа.Добавить(ПланыВидовХарактеристик.ВидыДоступа.Пользователи);
	СкрытыеВидыДоступа.Добавить(ПланыВидовХарактеристик.ВидыДоступа.ДополнительныеСведения);
	
	Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].ПравоеЗначение = СкрытыеВидыДоступа;
	
КонецПроцедуры
